// Определить из 2-х чисел является ли 1-е число квадратом 2-го числа

/*
Console.Write("Input a firt number:  ");
int num1=Convert.ToInt32(Console.ReadLine());
Console.Write("Input a second number:  ");
int num2=Convert.ToInt32(Console.ReadLine());

int quad=num2*num2;

if(num1==quad)
{
    Console.WriteLine("Yes");
}
else
{
    Console.WriteLine("No");
}
*/


// Задача программа показывающая от введенного числа до такого же только с плюсом или минусом все числа

/*
Console.Write("Input an integre number: ");
int num=Convert.ToInt32(Console.ReadLine());
int current = -num;
while(current <= num)
{
    Console.Write(current + " ");
    current++;
}
*/
